Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetBoltedPartsHoleElevations(System.Int32,System.Collections.Generic.Dictionary{System.Int32,System.Tuple{System.Double,System.Double}}@)
DO NOT USE! For internal usage only!
boltId:
holeElevations:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetExternalReferenceModelLayers(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
pClienId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.SetExternalReferenceModelLayerVisibilities(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
pClienId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetExternalReferenceModelSelections(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetShapeMetadata(Tekla.Structures.ModelInternal.dotClientId_t@,System.String)
DO NOT USE! For internal usage only!
ClientId:
guid: ///
Returns: Returns 1 if the operation was fully successful, otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportAppendMetadata(Tekla.Structures.ModelInternal.dotClientId_t@,System.String)
DO NOT USE! For internal usage only!
Returns: